<template>
    <div class="wrapper">
        <!--        The modal-->
        <div>
            <h1 class="h1">
                The modal
            </h1>
            <the-modal
                v-model:show-m="showModal"
                >
                modal
            </the-modal>
            <button @click="showModalHandle">
                show modal
            </button>
        </div>
        <!--        The tabs-->
        <div>
            <h1 class="h1">
                The tabs
            </h1>
            <the-tabs :tabs="['tab1','tab2','tab3']">
                <template #t0>
                    «О нет, только не очередная книга о природе и воспитании! Неужели действительно есть еще
                    люди, которые верят, что разум – чистый лист? Неужели не очевидно каждому, у кого хотя бы двое
                    детей, каждому, кто был в гетеросексуальных отношениях, каждому, кто замечал, что дети учатся
                    говорить, а домашние животные – нет: люди рождаются с определенными способностями и темпераментами?
                    Разве мы все не отказались от упрощенного противопоставления наследственности и среды и не осознали,
                    что любое поведение обусловлено взаимодействием между ними?»
                </template>
                <template #t1>
                    Примерно так отреагировали коллеги, когда я поделился с ними планами насчет этой книги. На
                    первый взгляд реакция небеспочвенная. Может быть, вопрос о врожденном и приобретенном действительно
                    уже не актуален. Любой, кто знаком с последними сочинениями на тему разума и поведения, наблюдал
                    притязания на золотую середину подобные этим:
                </template>
                <template #t2>
                    Если читатель теперь убежден, что либо генетическая, либо средовая теория одержала
                    окончательную победу и полностью вытеснила другую, значит, мы недостаточно хорошо проделали свою
                    работу, представляя вам ту или другую сторону. Нам кажется весьма вероятным, что и гены, и
                    окружающая среда имеют некоторое отношение к теме. Но в какой мере? Мы решительные агностики в этом
                    вопросе: насколько можно судить, имеющихся данных пока еще недостаточно для оценки.
                </template>
            </the-tabs>
        </div>
        <!--        /* slider */-->
        <div class="p100">
            <Slider v-model="values" />
        </div>

        <div class="p100">
            <Slider v-model="valuesRange" />
        </div>
    </div>
</template>

<script setup>
import { ref } from "vue"
/* the-modal */
const showModal = ref(false)

function showModalHandle() {
    showModal.value = !showModal.value
}

/* the-tabs */

/* slider */
import Slider from "@vueform/slider"

const values = ref(10)
const valuesRange = ref([0, 100])
</script>

<style scoped>
.wrapper {
    padding: 100px;
}
</style>
